{
    "text.entityculling.title": "EntityCulling",
    "key.category.minecraft.text.entityculling.title": "EntityCulling",
    "key.entityculling.toggle": "Alternância da depuração do culling",
    "key.entityculling.toggleBoxes": "Mostrar caixas de culling",
    "text.entityculling.tab.general_options": "Geral",
    "text.entityculling.tab.tick_culling": "Ignorar Culling de Ticks",
    "text.entityculling.tab.tick_culling.tooltip": "As entidades selecionadas nesta aba não terão seu método de tick otimizado quando ocultas. Isso pode ser útil para entidades que precisam de tick para determinadas funcionalidades, como barcos.",
    "text.entityculling.tab.entity_culling": "Ignorar Entidades",
    "text.entityculling.tab.entity_culling.tooltip": "As entidades selecionadas nesta aba não serão ocultas. Isso é necessário principalmente para entidades do lado do cliente ou entidades que precisam ser renderizadas independentemente de sua visibilidade.",
    "text.entityculling.tab.block_entity_culling": "Ignorar Bloco-entidades",
    "text.entityculling.tab.block_entity_culling.tooltip": "Os bloco-entidades selecionados nesta aba não serão ocultos. Isso é necessário principalmente para bloco-entidades que precisam ser renderizados independentemente de sua visibilidade.",
    "text.entityculling.renderNametagsThroughWalls": "Renderizar etiquetas através das paredes",
    "text.entityculling.renderNametagsThroughWalls.tooltip": "Quando desativado, as entidades ocultas não terão suas etiquetas renderizadas através das paredes.",
    "text.entityculling.tickCulling": "Culling de tick",
    "text.entityculling.tickCulling.tooltip": "Quando ativado, as entidades que são ocultas não terão ticks. Isso pode melhorar o desempenho em alguns casos, mas pode causar problemas com certos mods. Considere as opções de controle mais precisas na outra aba.",
    "text.entityculling.disableF3": "Desativar a informação de depuração no F3",
    "text.entityculling.disableF3.tooltip": "Quando ativado, a informação de depuração no F3 não mostrará informações de culling.",
    "text.entityculling.skipEntityCulling": "Ignorar culling de entidades",
    "text.entityculling.skipEntityCulling.tooltip": "Quando ativado, o culling de entidades será totalmente ignorado. Isso pode ser útil para depuração ou quando você deseja desativar o culling temporariamente.",
    "text.entityculling.skipBlockEntityCulling": "Ignorar culling de bloco-entidades",
    "text.entityculling.skipBlockEntityCulling.tooltip": "Quando ativado, o culling de bloco-entidades será totalmente ignorado. Isso pode ser útil para depuração ou quando você deseja desativar o culling temporariamente.",
    "text.entityculling.blockEntityFrustumCulling": "Culling frustum de bloco-entidades",
    "text.entityculling.blockEntityFrustumCulling.tooltip": "Quando ativado, a extração do estado do bloco-entidade será selecionada com base no frustum de visão da câmera. Isso pode melhorar o desempenho caso seu modloader/outro mod ainda não faça isso."
}
